Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.GetLabel Method (Boolean)
 Gets the label of the user property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetLabel(
	bool translated
)
Public Function GetLabel (
	translated As Boolean
) As String
Parameters
translated
Type: System.Boolean
if set to true translated text is returned.
Return Value
Type: String
 The label of the user property.
See Also
Reference
UserPropertyItem Class
GetLabel Overload
Tekla.Structures.Catalogs Namespace